---
kind: property
id: P:Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.PlaceAirTerminalOnDuct
source: html/40c82317-b100-7516-1daf-f47483abdb83.htm
---
# Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.PlaceAirTerminalOnDuct Property

If true, when placing an air terminal, the terminal will be placed directly on the duct without fittings.
 If fase, the terminal will be placed with generated fittings.

## Syntax (C#)
```csharp
public bool PlaceAirTerminalOnDuct { get; set; }
```